// 扩展 jQuery 元素集来提供新的方法.
jQuery.fn.extend({

	// 实现页面回跳.
	// 参数说明:url为指定的跳转页面,如果不指定此页面,则跳回上一页面.
    backwards: function(url) {

    	$(this).on("click",function(){
    		if(url){
    			window.open(url);
    		}else{
    			window.history.back();

    			// ------------------------------------------------------------
    			// 有一个问题,回退回去后,iframe里面的内容和下导航栏对不上号.
    			// 因为iframe的src和下导航栏没有绑定...
    			// 需要找一个方法记录导航栏的选定状态.本地session？？

    			// ------------------------------------------------------------
    			// 另外,通过子页链接出去后,iframe的src不会变。。。！！


    			// ------------------------------------------------------------
    			// 关闭当前窗口.
    			// window.close()
    			// 方法 close() 将关闭有 window 指定的顶层浏览器窗口。某个窗口可以通过调用 self.close() 或只调用 close() 来关闭其自身。
				// 只有通过 JavaScript 代码打开的窗口才能够由 JavaScript 代码关闭。这阻止了恶意的脚本终止用户的浏览器。
    		}
    	});
    }



    // ------------------------------------------------------------
    // 突然发现有新建页面-关闭当前页面一说.(但是全都得由js来操作)
    // js打开某页面
    // openWindow: function(url) {

    // }
    

    // ------------------------------------------------------------
    // 关闭js打开的页面
    // closeWindow: function(){

    // }


    // ------------------------------------------------------------
    // 冒泡排序方法.
    // bubblelist: function(){

    // }

})
